{
    "story": "Вы просыпаетесь в заброшенной хижине, окутанной мраком. Вас охватывает ощущение, что этот мир пропитан злом и опасностями. Вам предстоит отправиться в путешествие, чтобы столкнуться с неизвестными ужасами и раскрыть тайны этого мрачного мира.",
    "characters": [
      {
        "name": "Элиас Даркморн",
        "description": "Таинственный и смелый воин с черными волосами и серыми глазами. Он стремится к справедливости и готов рискнуть своей жизнью, чтобы защитить других.",
        "location": "start"
      },
      {
        "name": "Морган Темносердый",
        "description": "Жестокий и коварный антагонист. Он лишен совести и не останавливается ни перед чем, чтобы достичь своих целей. Он владеет магией тьмы и использует ее силу для манипуляции и порабощения других.",
        "location": null
      }
    ],
    "locations": {
      "start": "Вы находитесь в начальной точке. Ваше путешествие только начинается.",
      "Левый лес": "Вы входите в мрачный и густой лес, где каждое дерево кажется живым. Здесь полно опасностей и тайн.",
      "Правый лес": "Вы попадаете в лес, где царит мистика и загадки. Тени скрываются среди деревьев, и ветер несет зловещие шепоты.",
      "Левый сундук": "Вы обнаруживаете старый запертый сундук. Кажется, он давно забыт и скрыт от посторонних глаз.",
      "Левый мост": "Вы подходите к старому разрушенному мосту, который ведет к таинственным землям. Мост выглядит ненадежным и опасным, но вам нужно перейти его, чтобы продолжить свое путешествие.",
      "Правый берег": "Вы достигаете берега мрачного озера. Его темные воды кажутся глубокими и необъятными. Здесь скрываются тайны и опасности.",
      "Темный зал": "Вы входите в темный зал, где царит мистика и ужас. Здесь вас ожидает финальное испытание и смертельная схватка с Морганом Темносердым."
    },
    "items": {
      "Меч": "Меч - оружие, которое дает силу и мощь. Он может пробить даже самую прочную броню врагов.",
      "Зелье здоровья": "Зелье здоровья - напиток, который восстанавливает ваше здоровье, давая вам силы для продолжения борьбы.",
      "Ключ": "Ключ - предмет, который открывает запертые двери и сундуки, давая вам доступ к новым местам и возможностям."
    },
    "steps": [
      {
        "message": "Вы находитесь в начальной точке. Вам предлагается выбрать, куда идти: налево или направо.",
        "options": [
          {
            "text": "Пойти налево",
            "nextStep": 2,
            "requirements": {},
            "stats": {},
            "item": null,
            "location": "Левый лес"
          },
          {
            "text": "Пойти направо",
            "nextStep": 3,
            "requirements": {},
            "stats": {},
            "item": null,
            "location": "Правый лес"
          }
        ]
      },
      {
        "message": "Вы идете налево. Что вы найдете на своем пути?",
        "options": [
          {
            "text": "Найти сундук",
            "nextStep": 4,
            "requirements": {},
            "stats": {},
            "item": { "name": "Ключ", "description": "Старый ключ, который может открыть запертые двери" },
            "location": "Левый сундук"
          },
          {
            "text": "Пройти мост",
            "nextStep": 5,
            "requirements": {},
            "stats": {},
            "item": null,
            "location": "Левый мост"
          }
        ]
      },
      {
        "message": "Вы идете направо. Что вы найдете на своем пути?",
        "options": [
          {
            "text": "Сразиться с монстром",
            "nextStep": 6,
            "requirements": {},
            "stats": {},
            "item": null,
            "location": "Правый берег"
          },
          {
            "text": "Найти ключ",
            "nextStep": 7,
            "requirements": {},
            "stats": {},
            "item": { "name": "Меч", "description": "Мощный меч, который придает силу и мастерство в боях" },
            "location": "Правый берег"
          }
        ]
      },
      {
        "message": "Вы нашли сундук. Что вы сделаете?",
        "options": [
          {
            "text": "Открыть сундук",
            "nextStep": 8,
            "requirements": {},
            "stats": {},
            "item": { "name": "Зелье здоровья", "description": "Магическое зелье, которое восстанавливает здоровье персонажа" },
            "location": "Левый сундук"
          },
          {
            "text": "Пройти дальше",
            "nextStep": 9,
            "requirements": {},
            "stats": {},
            "item": null,
            "location": "Левый сундук"
          }
        ]
      },
      {
        "message": "Ваше путешествие продолжается...",
        "options": [
          {
            "text": "..."
          }
        ]
      }
    ]
  }
  