{
  "id": 0,
  "location": {
    "image": "ar1/ar1_knights.png"
  },
  "messages": [
    {
      "author": "Автор",
      "content": "В тени вековых деревьев, два всадника в тяжелых доспехах проезжали через тихую деревушку, измотанные и пыльные от долгого пути."
    },
    {
      "author": "Первый всадник",
      "avatar": "n/knight_1.png",
      "content": "Куда нас занесло? В этой дыре даже выпить негде!"
    },
    {
      "author": "Второй всадник",
      "avatar": "n/knight_2.png",
      "content": "Брат мой! Не падай духом! хоть эта деревушка и кажется жалкой. Наш священный долг - нести свет и надежду всем, кто в них нуждается..."
    },
    {
      "author": "Второй всадник",
      "avatar": "n/knight_2.png",
      "content": "Даже если у них нет денег на выпивку!"
    },
    {
      "author": "Автор",
      "content": "Юный Гайвин и его друзья притаились за углом дома, пытаясь подслушать о чем говорят господа конники."
    },
    {
      "author": "Друг Гайвина",
      "avatar": "n/friend.png",
      "content": "Наверное, они тут ищут чудовищ, чтобы сразиться с ними!"
    },
    {
      "author": "Гайвин",
      "avatar": "n/gaivin.png",
      "content": "Я кстати вчера уничтожил одно чудище."
    },
    {
      "author": "Другой друг",
      "avatar": "n/friend2.png",
      "content": "И, что за чудище это было? Мамина швабра?"
    },
    {
      "author": "Автор",
      "content": "Выберите ваш класс, от класса зависит Ваш подход к решению задач."
    }
  ],
  "options": [
    {
      "id": 0,
      "text": "Балабол",
      "img_key": "ra-two-hearts",
      "result": {
        "choose_class":"Балабол",
        "messages": [
          {
            "author": "Гайвин",
            "avatar": "n/gaivin.png",
            "content": "О, это было не просто чудище, это воплощение всех твоих ночных кошмаров! Представь себе сущность, которая ворует твои мечты и превращает их в крошечные прачечные счета! Не удивительно, что мы спасли деревню от его ужасных лап."
          }          
        ],
        "options": [
          {
            "id": 0,
            "text": "К приключениям!",
            "nextStep": 1
          }
        ]
      }
    },
    {
      "id": 1,
      "text": "Проныра",
      "img_key": "ra-knife",
      "result": {
        "choose_class":"Проныра",
        "messages": [
          {
            "author": "Гайвин",
            "avatar": "n/gaivin.png",
            "content": "Чудище? Да это было что-то между зловещим чудом и маминым штопором! Оно скользило по теням, как я по карманам деревенских простаков. Мы еле успели его поймать, прежде чем оно исчезло без следа."
          }          
        ],
        "options": [
          {
            "id": 0,
            "text": "К богатству!",
            "nextStep": 1
          }
        ]
      }
    },
    {
      "id": 2,
      "text": "Борзый",
      "img_key": "ra-axe",
      "result": {
        "choose_class":"Борзый",
        "messages": [
          {
            "author": "Гайвин",
            "avatar": "n/gaivin.png",
            "content": "Сейчас мой кулак расскажет тебе все подробности."
          }          
        ],
        "options": [
          {
            "id": 0,
            "text": "К новой силе!",
            "nextStep": 1
          }
        ]
      }
    },
    {
      "id": 3,
      "text": "Подробнее о классах",
      "result": {
        "messages": [
          {
            "author": "Автор",
            "content": "Балабол: Оружие - смазливый язык и обаятельная улыбка. Любимый напиток - мёдовуха (чтобы голос был сладким). Девиз - Язык мой - враг мой, если конечно молчит."
          },      
          {
            "author": "Автор",
            "content": "Особенности класса: 1. Может заговорить любого противника до смерти. 2. Имеет шикарную прическу и блестящие зубы. 3. От красноречия противники впадают в ступор."
          },     
          {
            "author": "Автор",
            "content": "Бонусные навыки: 1. Масло в уши - усыпляет бдительность врагов сладкими речами. 2. Словесный понос - наносит урон болтовнёй не хуже яда."
          },  
          {
            "author": "Автор",
            "content": "Проныра: Оружие - ловкие пальцы и отмычки. Любимый напиток - Любимый напиток - дешёвое пойло (экономит на всём). Девиз - Воруй с умом, живи с комфортом."
          },      
          {
            "author": "Автор",
            "content": "Особенности класса: 1. Может прокрасться куда угодно незамеченным. 2. Отлично ориентируется в тенях и подворотнях. 3. Чует запах денег за версту."
          },     
          {
            "author": "Автор",
            "content": "Бонусные навыки: 1. Тихая поступь - передвигается бесшумно как кошка. 2. Длинные пальцы - вытаскивает предметы из карманов на расстоянии."
          },      
          {
            "author": "Автор",
            "content": "Борзый: Оружие - крепкие кулаки и яростный напор. Любимый напиток - Любимый напиток - самогон с перцем (зажигает агрессию). Девиз - Кулаками слава добывается!"
          },      
          {
            "author": "Автор",
            "content": "Особенности класса: 1. Рубит любого врага в капусту. 2. От ударов противники впадают в нокаут. 3. Ломится сквозь препятствия как бульдозер."
          },     
          {
            "author": "Автор",
            "content": "Бонусные навыки: 1. Ярость берсерка - входит в неистовый раж и наносит критический урон. 2. Кирпичные кулаки - игнорирует боль и лупит противников с утроенной силой."
          }         
        ]
      }
    }
  ]
}